def numbers_to_text(numbers_str): # Създаваме речник за съответствието между букви и цифри, който съпоставя всяка кирилска буква с нейния цифров еквивалент.
    num_to_char = {
        '31': 'А',
        '2': 'Б',
        '3': 'В',
        '4': 'Г',
        '5': 'Д',
        '6': 'Е',
        '7': 'Ж',
        '8': 'З',
        '9': 'И',
        '10': 'Й',
        '11': 'К',
        '12': 'Л',
        '13': 'М',
        '14': 'Н',
        '15': 'О',
        '16': 'П',
        '17': 'Р',
        '18': 'С',
        '19': 'Т',
        '20': 'У',
        '21': 'Ф',
        '22': 'Х',
        '23': 'Ц',
        '24': 'Ч',
        '25': 'Ш',
        '26': 'Щ',
        '27': 'Ъ',
        '28': 'Ь',
        '29': 'Ю',
        '30': 'Я'
    }
    
    numbers = numbers_str.split(', ') # входния низ с числа се разделя на отделни числа чрез split(', ') - премахва се интервала и запетаята
    text = []
    
    for num in numbers: # за сяко число се проверява ->
        if num in num_to_char: # ако е в речника, се добавя съответната буква в променливата text
            text.append(num_to_char[num])
        else:
            text.append(num)  # Ако числото не е в речника, го добавяме както е (за препинателни знаци и др.). Както в ttn може да се работи само с речника или не.
    
    result = ''.join(text) # съединяваме буквите без интервали
    return result

# Примерна употреба ->
input_numbers = input("Въведете числа разделени със ', ': ")
output_text = numbers_to_text(input_numbers)
print(output_text)
