def text_to_numbers(text): # Създаваме речник за съответствието между букви и цифри, който съпоставя всяка кирилска буква с нейния цифров еквивалент.
    char_to_num = {
        'А': '31',
        'Б': '2',
        'В': '3',
        'Г': '4',
        'Д': '5',
        'Е': '6',
        'Ж': '7',
        'З': '8',
        'И': '9',
        'Й': '10',
        'К': '11',
        'Л': '12',
        'М': '13',
        'Н': '14',
        'О': '15',
        'П': '16',
        'Р': '17',
        'С': '18',
        'Т': '19',
        'У': '20',
        'Ф': '21',
        'Х': '22',
        'Ц': '23',
        'Ч': '24',
        'Ш': '25',
        'Щ': '26',
        'Ъ': '27',
        'Ь': '28',
        'Ю': '29',
        'Я': '30'
    }
    
    upper_text = text.upper() # преобразува текста в главни букви за да съвпада с ключовете в речника
    numbers = []
    
    for char in upper_text:
        if char in char_to_num:
            numbers.append(char_to_num[char])
        elif char == ' ':
            continue  # пропускаме интервалите
        else:
            numbers.append(char) # ако символът не е в речника, се добавя както е (за препинателни знаци и др.), тука може да се доработи да трие/пропуска знаци които не са в речника
    
    result = ', '.join(numbers) # съединяват се числата със запетая и интервал
    return result

# Примерна употреба ->
input_text = input("Въведете текст: ")
output_numbers = text_to_numbers(input_text)
print(output_numbers)
